#include<bits/stdc++.h>
using namespace std;
int main(int argc, char const *argv[])
{
    
    cout<<"2333哈哈哈"<<endl;
    
    getchar();getchar();getchar();
    return 0;
}

1. fa[100010] 父亲节点
2. wa[100010] 敌人
3. n,m n个罪犯 m对仇恨

结构体 : x,y,w;
重载小于号,从大到小排列;


1. 查找函数
2. 判断函数
3. 合并函数

------------------------------------------------------

1. head 头节点 
2. tail 尾节点
3. dp[i][j] 从 i 到 j 的最大价值
4. dp[i][j] = max(dp[i][k] + dp[k+1][j] + head[i] * tail[k] * head[j])

······················································

P1233 木棍加工

贪心法 

1. 结构体存储 木棍的长度和宽度
2. 运算符重载排序 从大到小排序木棍的长度，如果长度相同就从大到小排序宽度
3. 双层循环选择宽度比他小的木棍，然后打标记
4. 统计没有被标记的木棍个数
5. 输出答案